{"recipes":[{"id":0,"meal":"Traditional Croatian Goulash","image":"https://www.themealdb.com/images/media/meals/n1hcou1628770088.jpg","ingredients":["Beef","Onions","Carrots","Garlic","Bay Leaf","Red Wine","Water","Mustard","Salt","Pepper","Paprika","Vegetable Oil"],"measurements":["500g","2 chopped","2 chopped","2 cloves","2","200ml","2 Liters","3 tbs","1/2 tsp","1/2 tsp","2 tbs"],"instructions":["Clean the meat from the veins if there are some and cut it into smaller pieces, 3 × 3 cm. Marinate the meat in the mustard and spices and let it sit in the refrigerator for one hour.","Heat one tablespoon of pork fat or vegetable oil in a pot and fry the meat on all sides until it gets browned.","Once the meat is cooked, transfer it to a plate and add another tablespoon of fat to the pot","Cut the onions very fine, peel the carrots and shred it using a grater.","Cook the onions and carrots over low heat for 15 minutes. You can salt the vegetables a little to make them soften faster","Once the vegetables have browned and become slightly mushy, add the meat and bay leaves and garlic. Pour over with wine and simmer for 10-15 minutes to allow the alcohol to evaporate. Now is the right time to add 2/3 the amount of liquid","Cover the pot and cook over low heat for an hour, stirring occasionally. After the first hour, pour over the rest of the water or stock and cook for another 30-45 minutes","Allow the stew to cool slightly and serve it with a sprinkle of chopped parsley and few slices of fresh hot pepper if you like to spice it up a bit\r\nSlice ​​some fresh bread, season the salad and simply enjoying these wonderful flavors"]},{"id":1,"meal":"Tunisian Lamb Soup","image":"https://www.themealdb.com/images/media/meals/t8mn9g1560460231.jpg","ingredients":["Lamb Mince","Garlic","Onion","Spinach","Tomato Puree","Cumin","Chicken Stock","Harissa Spice","Chickpeas","Lemon Juice","Macaroni","Salt","Pepper"],"measurements":["500g","2 cloves minced","1","300g","3 tbs","1 tbs","1 Liter","3 tsp","400g","1/2","150g","Pinch","Pinch"],"instructions":["Add the lamb to a casserole and cook over high heat. When browned, remove from the heat and set aside.","Keep a tablespoon of fat in the casserole and discard the rest. Reduce to medium heat then add the garlic, onion and spinach and cook until the onion is translucent and the spinach wilted or about 5 minutes.","Return the lamb to the casserole with the onion-spinach mixture, add the tomato puree, cumin, harissa, chicken, chickpeas, lemon juice, salt and pepper in the pan. Simmer over low heat for about 20 minutes.","Add the pasta and cook for 15 minutes or until pasta is cooked."]}]}